Repository: AndryXY/apps
Catalog: l10n/*/contacts.po
Languages: si_lk

source: Error (de)activating addressbook.
si_lk: ලිපි ලැයිස්තුව (අ)ක්‍රිය කිරීමේ දෝෂයක්

source: id is not set.
si_lk: අංකය සකසා නැත.

source: Cannot update addressbook with an empty name.
si_lk: නමක් නොමැතිව ලිපි ලැයිස්තුව යාවත්කාලීන කළ නොහැක

source: No ID provided
si_lk: ID සපයා නැත

source: No categories selected for deletion.
si_lk: මකා දැමීම සඳහා ප්‍රවර්ගයන් තෝරා නොමැත.

source: No address books found.
si_lk: ලිපින පොත් හමු නොවිනි

source: No contacts found.
si_lk: සබඳතා හමු නොවිනි

source: element name is not set.
si_lk: අවයවය සඳහා නමක් දමා නැත

source: Cannot add empty property.
si_lk: අයිතිය ශුන්‍යව එක් කළ නොහැක.

source: At least one of the address fields has to be filled out.
si_lk: අඩුම තරමින් එක් යොමු ක්‍ෂේත්‍රයක්වත් පිරවිය යුතුයි.

source: Trying to add duplicate property:
si_lk: අයිතියෙහි අනුපිටපතක් එක් කිරීමට උත්සාහ කිරීම:

source: Information about vCard is incorrect. Please reload the page.
si_lk: vCard පිළිබඳ තොරතුරු අසත්‍යයි. කරුණාකර පිටුව නැවත බාගත කරන්න.

source: Missing ID
si_lk: හැඳුනුම් අංකය නොමැත

source: Something went FUBAR.
si_lk: යම් කිසිවක් FUBAR විය

source: No contact ID was submitted.
si_lk: සබඳතා අංකය සපයා නැත.

source: Error reading contact photo.
si_lk: හඳුනාගැනීමේ ඡායාරූපය කියවීම දෝෂ සහිතයි.

source: Error saving temporary file.
si_lk: තාවකාලික ගොනුව සුරැකීම දෝෂ සහිතයි.

source: The loading photo is not valid.
si_lk: පූරණය වන රූපය වලංගු නැත

source: Contact ID is missing.
si_lk: සබඳතා හැඳිනුම් අංකය නොමැත.

source: File doesn't exist:
si_lk: ගොනුව නොපවතී

source: Error loading image.
si_lk: රූපය පූරණය දෝෂ සහිතයි.

source: Error getting contact object.
si_lk: සම්බන්ධතා වස්තුව ගෙන ඒමේදී දෝෂයක්

source: Error saving contact.
si_lk: සම්බන්ධතාව සුරැකිමේදී දෝෂයක්

source: Error creating temporary image
si_lk: තාවකාලික ඡායාරූපයක් තැනීමේ දෝෂයක්

source: Error finding image:
si_lk: ඡායාරූපය සොයාගැනීමේ දෝෂයක්

source: Error uploading contacts to storage.
si_lk: ගබඩාවට පුද්ගල විස්තර උඩුගත කිරීමේ දෝෂයක්

source: There is no error, the file uploaded with success
si_lk: දෝෂයක් නොමැත. සාර්ථකව ගොනුව උඩුගත කෙරුණි

source: The uploaded file exceeds the upload_max_filesize directive in php.ini
si_lk: php.ini හි upload_max_filesize නියමයට වඩා ගොනුව විශාලය

source: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the HTML form
si_lk: උඩුගත කළ ගොනුවේ විශාලත්වය HTML පෝරමයේ නියම කළ ඇති MAX_FILE_SIZE විශාලත්වයට වඩා වැඩිය

source: The uploaded file was only partially uploaded
si_lk: උඩුගත කළ ගොනුවේ කොටසක් පමණක් උඩුගත විය

source: No file was uploaded
si_lk: ගොනුවක් උඩුගත නොවුණි

source: Missing a temporary folder
si_lk: තාවකාලික ෆොල්ඩරයක් අතුරුදහන්

source: Couldn't save temporary image:
si_lk: තාවකාලික රූපය සුරැකීමට නොහැකි විය

source: No file was uploaded. Unknown error
si_lk: ගොනුවක් උඩුගත නොවුනි. නොහැඳිනු දෝෂයක්

source: Contacts
si_lk: සබඳතා

source: Sorry, this functionality has not been implemented yet
si_lk: සමාවන්න, මෙම කාර්යය තවම සාදා එකතු කොට නැත

source: Not implemented
si_lk: සාදා එකතු කොට නැත

source: Couldn't get a valid address.
si_lk: වලංගු ලිපිනයක් ලබාගැනීමට නොහැකි විය

source: Error
si_lk: දෝෂයක්

source: Enter name
si_lk: නම දෙන්න

source: Select type
si_lk: වර්ගය තෝරන්න

source: You do not have permission to add contacts to
si_lk: සම්බන්ධතා එකතු කිරීමට ඔබට අවසර නැත

source: Please select one of your own address books.
si_lk: කරුණාකර ඔබේම ලිපින පොතක් තෝරන්න

source: Permission error
si_lk: අනුමැතියේ දෝෂයක්

source: Edit name
si_lk: නම සංස්කරණය කරන්න

source: No files selected for upload.
si_lk: උඩුගත කිරීමට ගොනු තෝරා නැත

source: The file you are trying to upload exceed the maximum size for file uploads on this server.
si_lk: ඔබ උඩුගත කිරීමට තැත් කරන ගොනුව, සේවාදායකයාට උඩුගත කළ හැකි උපරිම ගොනු විශාලත්වයට වඩා වැඩිය

source: Some contacts are marked for deletion, but not deleted yet. Please wait for them to be deleted.
si_lk: සමහර සම්බන්ධතා මකන ලෙස ලකුණු කොට ඇත. කරුණාකර ඒවා මැකෙන තෙක් සිටින්න

source: Do you want to merge these address books?
si_lk: ඔබට මෙම ලිපින පොත් දෙක එකතු කිරීමට අවශ්‍යද?

source: Upload too large
si_lk: උඩුගත කිරීම විශාල වැඩිය

source: Upload Error
si_lk: උඩුගත කිරීමේ දෝෂයක්

source: Import done
si_lk: ආයාත කිරීම අවසන්

source: Result:
si_lk: ප්‍රතිඵලය:

source: imported,
si_lk: ආයාත කරන ලදී,

source: failed.
si_lk: අසාර්ථකයි

source: Displayname cannot be empty.
si_lk: පෙන්වන නම හිස්ව තිබිය නොහැක

source: Download
si_lk: බාගත කිරීම

source: Edit
si_lk: සකසන්න

source: Delete
si_lk: මකන්න

source: Cancel
si_lk: එපා

source: More...
si_lk: තවත්...

source: Less...
si_lk: අඩුවෙන්...

source: You do not have the permissions to update this addressbook.
si_lk: මෙම ලිපින පොත යාවත්කාලීන කිරීමට ඔබට අවසර නැත

source: There was an error updating the addressbook.
si_lk: මෙම ලිපින පොත යාවත්කාලීන කිරීමේදී දෝෂයක් ඇති විය

source: You do not have the permissions to delete this addressbook.
si_lk: මෙම ලිපින පොත මැකීමට ඔබට අවසර නැත

source: There was an error deleting this addressbook.
si_lk: මෙම ලිපින පොත මැකීමේදී දෝෂයක් ඇති විය

source: Addressbook not found:
si_lk: ලිපින පොත හමු නොවුනි

source: This is not your addressbook.
si_lk: මේ ඔබේ ලිපින පොත නොවේ

source: Contact could not be found.
si_lk: සබඳතාවය සොයා ගත නොහැක.

source: Work
si_lk: රාජකාරී

source: Home
si_lk: නිවස

source: Other
si_lk: වෙනත්

source: Mobile
si_lk: ජංගම

source: Text
si_lk: පෙළ

source: Voice
si_lk: හඬ

source: Message
si_lk: පණිවිඩය

source: Fax
si_lk: ෆැක්ස්

source: Video
si_lk: වීඩියෝව

source: Pager
si_lk: පේජරය

source: Internet
si_lk: අන්තර්ජාලය

source: Birthday
si_lk: උපන් දිනය

source: Business
si_lk: ව්‍යාපාරය

source: Call
si_lk: අමතන්න

source: Clients
si_lk: සේවාලාභීන්

source: Deliverer
si_lk: බාරදෙන්නා

source: Holidays
si_lk: නිවාඩු

source: Ideas
si_lk: අදහස්

source: Journey
si_lk: ගමන

source: Meeting
si_lk: රැස්වීම

source: Personal
si_lk: පෞද්ගලික

source: Projects
si_lk: ව්‍යාපෘති

source: Questions
si_lk: ප්‍රශ්ණ

source: {name}'s Birthday
si_lk: {name}ගේ උපන්දිනය

source: Contact
si_lk: සබඳතාව

source: You do not have the permissions to add contacts to this addressbook.
si_lk: මෙම ලිපින පොතට අලුත් සම්බන්ධතා එක් කිරීමට ඔබට අවසර නැත

source: You do not have the permissions to edit this contact.
si_lk: මෙම සම්බන්ධතාව සංස්කරණය කිරීමට ඔබට අවසර නැත

source: You do not have the permissions to delete this contact.
si_lk: මෙම සම්බන්ධතාව මැකීමට ඔබට අවසර නැත

source: There was an error deleting this contact.
si_lk: මෙම සම්බන්ධතාව මැකීමේදී දෝෂයක් ඇති විය

source: Add Contact
si_lk: සබඳතාවක් එක් කරන්න

source: Import
si_lk: ආයාත කරන්න

source: Settings
si_lk: සිටුවම්

source: Close
si_lk: වසන්න

source: Next addressbook
si_lk: මෙයට පසු ලිපින පොත

source: Previous addressbook
si_lk: මෙයට පෙර ලිපින පොත

source: Drop photo to upload
si_lk: උඩුගත කිරීමට මෙතැනට දමන්න

source: Delete current photo
si_lk: වර්තමාන ඡායාරූපය මකන්න

source: Edit current photo
si_lk: වර්තමාන ඡායාරූපය සංස්කරණය කරන්න

source: Upload new photo
si_lk: නව ඡායාරූපයක් උඩුගත කරන්න

source: Edit name details
si_lk: නමේ විස්තර සංස්කරණය කරන්න

source: Organization
si_lk: ආයතනය

source: Nickname
si_lk: පටබැඳි නම

source: Enter nickname
si_lk: පටබැඳි නම ඇතුලත් කරන්න

source: Web site
si_lk: වෙබ් අඩවිය

source: Go to web site
si_lk: වෙබ් අඩවියට යන්න

source: dd-mm-yyyy
si_lk: දිදි-මාමා-වවවව

source: Groups
si_lk: කණ්ඩායම්

source: Separate groups with commas
si_lk: කණ්ඩායම් කොමා භාවිතයෙන් වෙන් කරන්න

source: Edit groups
si_lk: කණ්ඩායම් සංස්කරණය කරන්න

source: Preferred
si_lk: රුචි

source: Please specify a valid email address.
si_lk: වලංගු විද්‍යුත් තැපැල් ලිපිනයක් ලබා දෙන්න

source: Enter email address
si_lk: විද්‍යුත් තැපැල් ලිපිනයක් දෙන්න

source: Mail to address
si_lk: තැපැල් එවිය යුතු ලිපිනය

source: Delete email address
si_lk: විද්‍යුත් තැපැල් ලිපිනය මකන්න

source: Enter phone number
si_lk: දුරකථන අංකයක් දෙන්න

source: Delete phone number
si_lk: දුරකථන අංකය මකන්න

source: View on map
si_lk: සිතියමේ පෙන්වන්න

source: Edit address details
si_lk: ලිපින විස්තර සංස්කරණය කරන්න

source: Add notes here.
si_lk: මෙතැන නෝට්ටුවක් තබන්න

source: Add field
si_lk: ක්ෂේත්‍රයක් එකතු කරන්න

source: Phone
si_lk: දුරකථන

source: Email
si_lk: ඉ-තැපැල්

source: Address
si_lk: ලිපිනය

source: Note
si_lk: නෝට්ටුවක්

source: Download contact
si_lk: සබඳතා බාගත කරන්න

source: Delete contact
si_lk: සබඳතාව මකන්න

source: Edit address
si_lk: ලිපිනය සංස්කරණය කරන්න

source: Type
si_lk: වර්ගය

source: PO Box
si_lk: තැ.පෙ.

source: Extended
si_lk: දීඝී කිරීම

source: City
si_lk: නගරය

source: Region
si_lk: කළාපය

source: Zipcode
si_lk: තැපැල් කේතය

source: Country
si_lk: රට

source: Addressbook
si_lk: ලිපින පොත

source: Hon. prefixes
si_lk: ගෞරවාන්විත නාම

source: Given name
si_lk: දී ඇති නම

source: Additional names
si_lk: වෙනත් නම්

source: Family name
si_lk: අවසන් නම

source: Import a contacts file
si_lk: සම්බන්ධතා ඇති ගොනුවක් ආයාත කරන්න

source: Please choose the addressbook
si_lk: කරුණාකර ලිපින පොත තෝරන්න

source: create a new addressbook
si_lk: නව ලිපින පොතක් සාදන්න

source: Name of new addressbook
si_lk: නව ලිපින පොතේ නම

source: Importing contacts
si_lk: සම්බන්ධතා ආයාත කරමින් පවතී

source: Add contact
si_lk: සම්බන්ධතාවක් එකතු කරන්න

source: Enter description
si_lk: විස්තරය දෙන්න

source: more info
si_lk: තව විස්තර

source: Addressbooks
si_lk: ලිපින පොත්

source: Share
si_lk: බෙදා හදා ගන්න

source: New Address Book
si_lk: නව ලිපින පොතක්

source: Name
si_lk: නම

source: Description
si_lk: විස්තරය

source: Save
si_lk: සුරකින්න
